# Импорт библиотек
import pygame
import random
from random import randint, choice, random

# Инициализация pygame
pygame.init()

# Основные настройки окна
WIDTH, HEIGHT = 800, 600  # Ширина и высота окна
FPS = 60  # Частота кадров

# Настройки управления
DIRECTS = [[0,-1], [1,0], [0,1], [-1,0]]  # Направления движения (вверх, вправо, вниз, влево)
TILE = 32  # Размер тайла (блока)

# Характеристики танков по уровням
MOVE_SPEED =    [1, 2, 2, 1, 2, 3, 3, 2]  # Скорость движения для каждого ранга
BULLET_SPEED =  [4, 5, 6, 5, 5, 5, 6, 7]  # Скорость пуль
BULLET_DAMAGE = [1, 1, 2, 3, 2, 2, 3, 4]  # Урон пуль
SHOT_DELAY =    [60, 50, 30, 40, 30, 25, 25, 30]  # Задержка между выстрелами